models/deepseek-v2-lite-lmcache-mp/benchmark_results/p50_sweep_20260324_130021/sweep.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x713a5b1fa980>, trust_remote_code=False, seed=7, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=20.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260324_130021', result_filename='qps20_20260324_130021.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-dcfc8f25-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=True, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 03-24 13:02:15 [datasets.py:631] Sampling input_len from [1869, 1869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 20.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [03:49<00:00,  4.36it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           20.00     
Benchmark duration (s):                  229.30    
Total input tokens:                      7869000   
Total generated tokens:                  252000    
Request throughput (req/s):              4.36      
Output token throughput (tok/s):         1099.01   
Peak output token throughput (tok/s):    2400.00   
Peak concurrent requests:                878.00    
Total token throughput (tok/s):          35416.76  
---------------Time to First Token----------------
Mean TTFT (ms):                          86958.72  
Median TTFT (ms):                        85550.49  
P50 TTFT (ms):                           85550.49  
P90 TTFT (ms):                           152702.55 
P95 TTFT (ms):                           165632.06 
P99 TTFT (ms):                           168196.06 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          76.07     
Median TPOT (ms):                        78.65     
P50 TPOT (ms):                           78.65     
P90 TPOT (ms):                           85.00     
P95 TPOT (ms):                           86.90     
P99 TPOT (ms):                           90.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           76.07     
Median ITL (ms):                         47.86     
P50 ITL (ms):                            47.86     
P90 ITL (ms):                            111.24    
P95 ITL (ms):                            265.40    
P99 ITL (ms):                            721.19    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          106051.28 
Median E2EL (ms):                        104472.52 
P50 E2EL (ms):                           104472.52 
P90 E2EL (ms):                           171040.00 
P95 E2EL (ms):                           181019.68 
P99 E2EL (ms):                           182371.98 
==================================================
/usr/lib/python3.12/asyncio/events.py:88: UserWarning: Failed to generate timeline plot: Please install vllm[bench] for bench support
  self._context.run(self._callback, *self._args)