models/deepseek-v2-lite-lmcache-mp/benchmark_results/p50_sweep_20260324_130021/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72725dbe6980>, trust_remote_code=False, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260324_130021', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-6796e5de-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=True, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 03-24 13:00:44 [datasets.py:631] Sampling input_len from [1869, 1869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:30<00:00,  3.27it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  30.54     
Total input tokens:                      786900    
Total generated tokens:                  25200     
Request throughput (req/s):              3.27      
Output token throughput (tok/s):         825.20    
Peak output token throughput (tok/s):    1420.00   
Peak concurrent requests:                70.00     
Total token throughput (tok/s):          26593.07  
---------------Time to First Token----------------
Mean TTFT (ms):                          450.72    
Median TTFT (ms):                        434.89    
P50 TTFT (ms):                           434.89    
P90 TTFT (ms):                           552.17    
P95 TTFT (ms):                           591.16    
P99 TTFT (ms):                           623.64    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.44     
Median TPOT (ms):                        45.78     
P50 TPOT (ms):                           45.78     
P90 TPOT (ms):                           47.74     
P95 TPOT (ms):                           47.82     
P99 TPOT (ms):                           47.94     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.44     
Median ITL (ms):                         41.84     
P50 ITL (ms):                            41.84     
P90 ITL (ms):                            58.30     
P95 ITL (ms):                            66.96     
P99 ITL (ms):                            82.99     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11855.60  
Median E2EL (ms):                        11964.82  
P50 E2EL (ms):                           11964.82  
P90 E2EL (ms):                           12406.22  
P95 E2EL (ms):                           12440.88  
P99 E2EL (ms):                           12465.85  
==================================================
/usr/lib/python3.12/asyncio/events.py:88: UserWarning: Failed to generate timeline plot: Please install vllm[bench] for bench support
  self._context.run(self._callback, *self._args)